[
  {
    "path": "posts/2021-05-02-cruise-ships/",
    "title": "Editorial- Cruise Ships",
    "description": "An editorial about the fuel consumption of cruise liners.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-05-02",
    "categories": [],
    "contents": "\nIf you’re considering taking a cruise once the Pandemic is over, it may be time to think about other vacation options- in the name of Mother Nature. Cruises offer vacationers quite a lot of advantages: the chance to see and experiences new places and cultures; renowned on-board restaurants and wineries with menus from around the world, and entertainment for travelers of all ages. But at the end of the day, the more people, pool water, and ice cream that cruise companies pile on board, the more energy it takes to move the floating city from destination to destination. Those massive energy costs, both to the cruise lines and the environment, will be sure to make you (sea)sick to your stomach. \nThe word colossal doesn’t even begin to describe the size of the newest cruise ships setting sail, and it’s no doubt that they’re trending larger still. The ships sailing away from Royal Caribbean’s ports effuse four to five times as large as the RMS Titanic by internal volume. The number of crew members on a modern-day cruise ship nearly match the maximum number of passengers the Titanic could hold. Something has to keep the 228,000-ton monstrosity inching forward at the high seas. That something is diesel fuel. And a lot of it. \nFor a frame of reference, the average car sold in the United States as of 2019 gets about 25 miles per gallon (mpg) of gas/diesel consumed. If you find yourself rolling up to a Hollywood black tie event in a Rolls Royce Phantom, you’ll likely be getting 11 mpg. The paparazzi guy who drove his mom’s Honda Accord to the event is getting more like 30 mpg. The Boeing 737 you took from LaGuardia to LAX? 0.15 mpg. But how fuel efficient are cruise ships? \n0.0023 miles per gallon. \nIn a given day of sailing, at a cruising speed of 22.6 knots (26 mph), the Oasis of the Seas (one of the larger cruise ships) will burn 11,361 gallons of fuel each hour. The fuel efficiency, then, is 0.0023 mpg. In other words, for every 12.08 feet traveled, the ship will burn a gallon of diesel fuel. \nCruise ships like to add another calculation into their public relations - the mpg per passenger- which is a way to factor in the amount of people the car, airplane, or ship carries. Cruise ships bode quite poorly though still, averaging 17.5 mpg/passenger. Seventeen and a half mpg certainly sounds better than 0.0023 mpg, though, but airplanes average 91 mpg/ passenger. Not so fast, Carnival. \nCruise ships use a lot of fuel. Their diesel fueled generators power not only the massive propellers, but also the soft serve machines, pool heaters, and ovens. Pretty much anything you lay your eyes on contributes to the 66,000 gallons of fuel used per day. So the next time you’re going to click buy on Royal Caribbean or Carnival’s website, just think that with the amount of fuel used in just one day out of your seven-day trip, you’d be able to drive your car around the entire Earth about 66 times. Just let that sink in.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-02T18:10:12-04:00",
    "input_file": "cruise-ships.utf8.md"
  },
  {
    "path": "posts/2021-05-02-suez-canal/",
    "title": "Editorial- Suez Canal",
    "description": "An editorial about the Suez Canal blockage.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-05-02",
    "categories": [],
    "contents": "\nThe southernmost tip of Africa: a swath of sea ridden with gruesome shipwrecks and lore of abominable storms. For centuries, brave captains and their steadfast crews skillfully navigated this shipping route around the continent of Africa- for it was the only way to transport teas and spices from India to Europe. With the blockage of the Suez Canal by the Ever Given, captains face the same decision their predecessors did all those years ago: stay in the Indian Ocean or circumnavigate Africa. \nThe Ever Given’s blockage of the Suez Canal continues to profusely affect trade between the East and the West. On average, 93 cargo ships make their journey through the Suez Canal each day, which means over 400 ships currently await passage. Analysis from the Wall Street Journal shows the stranded ship is holding up an estimated $9.6bn of trade along the waterway each day. That equates to $400m and 3.3 million tons of cargo an hour, or $6.7m a minute. What options do the containership captains face? Wait in line for the freeing of the Ever Given or seek passage around the Cape of Good Hope. \nCircumnavigating Africa adds about eight days of travel to the journey from Taiwan to the Netherlands, on average. Eight days longer means feeding and paying your crew more, not to mention keeping the propellers turning for another 192 hours. However, once captains’ factor in all the costs, going around Africa makes much more sense than waiting in line for the Ever Given to be freed. \nFor the past year and a half, fuel prices have been trending lower, which means containerships can circumnavigate Africa for a much lower cost than historically possible. Furthermore, not using the Suez Canal means that shipping companies will avoid the $700,000 fee the Suez Canal Authority charges for passage of a fully loaded containership. When the economic impacts ($6.7m a minute) of stalling in the Indian Ocean are taken into account, turning around and heading for Africa is the clear choice. \n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-02T18:11:38-04:00",
    "input_file": "suez-canal.utf8.md"
  },
  {
    "path": "posts/2021-05-02-passwords/",
    "title": "Editorial- Social Media Password Laws",
    "description": "An editorial about changing social media password laws.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-05-02",
    "categories": [],
    "contents": "\nAmericans work hard, maybe even a little too hard, and the scale of work-life balance is tilting pretty heavily towards the “work side.” When the closing bell rings and the neon Open sign flickers out, the last thing employees want to think about is work- let alone worry about representing their company 24/7 every day of the year. A bill passed by the New York State legislature would help New York residents relax almost as much as that glass of wine after work. \nPassing New York AB 1844 would prohibit employers from requesting or requiring employees and applicants to disclose their social media log-in information for the purpose of accessing social media accounts. Passing such a law would not be unprecedented- California was the first state to pass such a policy eight years ago, and many other states have followed in their footsteps. The New York State legislature should also pass the bill to protect its citizens from the evident overreaching of the government and companies into the personal lives of employees across the state. \nRequesting or requiring employees and applicants to disclose their social media log-in information (including but not limited to passwords and usernames) adds a substantial load of stress on top of an already full load. Not only would employers be able to seen the front end of each social media platform (e.g. posts, comments, likes) but if passwords were no longer private, the employer would also have access to the account’s archives, private messages, and viewing history. Whether in the office or on the clock, such a policy would require the employee to represent the company at all times. All posts, messages, comments, and likes to become subject to review and potential scrutiny by the employer, adding substantial stress to the already fragile \nwork- life balance. Employers would have access to all front and back end content on all social media platforms, which could include messages with the man/woman who you like; it could include content that you’ve saved; it could include funny yet offensive memes that you’ve sent to your best friend. \nAccording to a study conducted by CNBC news, 26% of surveyed employees in the United States rate their stress level as 4.2/5 and altogether 70% of employees rate their stress as a 3.5/5 or higher. The South Louisiana Health Association, in concurrence with other leading health associations, cite that stress is the primary cause of many health problems, both mentally and physically. Employees do not need the added stress and anxiety that would come if employers had access to who their social media. Many working adults use social media as a way to unwind after work, and it is possible that their usage would decrease with employer intervention. Furthermore, constantly fearing termination or probation based on their online presence in and of itself induces stress and anxiety. \nSocial media also hosts a place for political and religious discourse. Granting employers the ability to see behind the scenes of their employees’ accounts welcomes the risk for discrimination in the workplace. Political and religious affairs are often private matters, and if a perspective employer or current employer discovers such private information, this could affect their attitude and propensity to hire somebody. Discrimination in the workplace laws make it illegal to discriminate based on religious, political, or otherwise private information. Allowing employer access to private information online would enable them to discriminate without anyone knowing about it. Your interviewer may not like that you’re posting LGBTQ events and refuse to hire you. Your boss may see that you attended a Bernie Sanders rally and refuse you your next \nraise. This infringement of privacy further breaks down the work-life balance relationship and requires the submission of your private life for the image of the company. \nIn some select cases, though, it would make sense for the employer to want access to the back end of individual’s social media accounts. Companies want to minimize their liabilities, and when they hire a person, they incur a liability for the actions of that individual, both professionally and privately. In light of the recent riots at the US Capitol, if a company or firm could have foreseen their employee’s involvement in the mob before they hired them via their social media trends, chances are they would not have hired that individual. The same can be said for excessive partying, drug use, or fringe group involvement that often appears on social media. If a firm can lower its liability, it will try to do so. Background checks and drug tests are common in the hiring process, and social media checks may very well be next on that list. \nThat being said, stalking social media accounts is not the best option in the hiring process, or at least it shouldn’t be. In some cases it might be useful in identifying problematic or criminal applicants, but there are better ways to identify those types of people. Maybe the hiring process needs some revamping. If employers cannot grasp the character of a person through an application, resume, cover letter, Hirevue, and multiple rounds of interviews, something must be wrong. Firm’s shouldn’t have to rely on social media to make informed decisions about their current or perspective employees. Though employees should be contentious of how their actions on social media might affect the firm they work for, it is a clear overstep of personal privacy to allow firms constant and unrestricted access to social media accounts. The marginal stress would be too high to justify the arduous and anxiety causing process, and firms most likely won’t be learning any new information anyway.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-02T18:13:03-04:00",
    "input_file": "passwords.utf8.md"
  },
  {
    "path": "posts/2021-05-02-lange/",
    "title": "Editorial- Lange vs. California",
    "description": "An editorial about the Supreme Court Case Lange vs. California.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-05-02",
    "categories": [],
    "contents": "\nFour seconds. Four seconds was all the time Arthur Lange had to react to flashing police lights before exiting his car and walk into his garage. Oh, and by the way, it typically takes the human brain 5 seconds to fully process what it’s seeing. Four seconds should not determine whether or not unwarranted search and seizure is lawful. Nor should the government allow an unwarranted search and seizure for any crime committed. \nIn the late evening of an October Friday in 2016, when California Highway Patrol Officer Aaron Weikert observed Arthur Lange playing music loudly and honking repeatedly while driving, Weikert thought Lange might be impaired and gave pursuit. But Weikert did not turn his flashing lights on as he gave pursuit, he followed Lange stealthily. It wasn’t until Lange was four seconds away from his garage door when Weikert remembered how to turn on his police lights. \nThe next thing Lange knows, he’s being arrested- in his garage- and the intent of the Fourth Amendment is confronted in the U.S. Supreme Court. \nThe question in Lange v. California is whether police officers who pursue someone suspected of a misdemeanor into a home may conduct a warrantless search or seizure. It is well-established that police in “hot pursuit” of a suspected felon in public may follow that suspect into a residence. But what about police who are in “hot pursuit” of a misdemeanant? \nIn the United States, misdemeanors account for 80% of American criminal dockets 2, which means that almost eight times out of 10, when a crime is committed, it’s a misdemeanor. Expanding the police’s authority to conduct unwarranted search and seizures for nearly every crime committed would be a massive over-reach by the government. \nPetty theft? The police can follow you into your home. Public intoxication? The police can search your things and personal effects. The “sanctity of the home,” as it were, would be a distant memory of a fleeting pastime. \nWhat’s more alarming about this governmental overreach, however, is its potential to worsen the relationship between minorities and the police, who already bear a disproportionate brunt of law enforcement. In his book David and Goliath, Malcom Gladwell contends that in order for policing to be effective (anywhere), the community must respect and find the police force legitimate. Gladwell continues to argue that when every minority has a brother or father or cousin in prison, it can be difficult to believe the system is fair or legitimate. If the system isn’t fair, how can you believe that those in charge of enforcing that system will be fair and impartial in return3 ? \nNow imagine that if every time a police officer had suspicion that a minority was committing a misdemeanor, that police officer had the right to search and seize that individual’s house without a warrant. The already frayed relationship between the police and minorities would be beyond repair. \nThe prosecution, however, does raise an interesting argument. The United States contends that the risk of a misdemeanant evading arrest can be just as great as for a felony suspect: in both cases, \"the suspect already has chosen to flee once, suggesting his willingness to take on the risks \nof flight again.4\" In fact, the United States contends that a suspect’s attempted escape suggests that he has committed a more serious offense than the one for which he is being pursued; in the moment, an officer may not be aware of the full scope of the crime. The prosecution goes on to argue that not granting the police force the ability to pursue without a warrant would encourage fleeing to house. \nThe prosecution’s argument, however, can be thinned in one of three ways. First, if Lange had actually been posing a serious threat to the community that he needed to escape into his house to prepare for it, then Weikert should have recognized that and turned on his lights sooner instead of at the last possible minute. If Lange was running from a more heinous crime, as purported, then why did Weikert wait so long to attempt to apprehend Lange? \nSecond, the prosecution’s entire argument rests upon the assertion that Lange was fleeing and evading the police officer. But Weikert did not signal to Lange that he was following him until four seconds before Lange entered his garage. Four seconds is not enough time to recognize that the glimpse of flashing lights behind were actually directed at you. \nThird, the ACLU assert that “requiring police to obtain a warrant in hot pursuit situations would not encourage fleeing because police can procure warrants remotely within minutes.” \nThe government’s desire to allow unwarranted search and seizure in the case of misdemeanors would directly infringe upon the right guaranteed under the Fourth Amendment. It would serve as a massive over-reach of the government and police force and could be disproportionally concentrated upon communities that already bear the burden of excessive policing. Furthermore, these costly externalities come without novel benefits. The solutions already exist in the criminal justice system. \n“America’s Massive Misdemeanor System Deepens Inequality and Burdens Low-Income Communities.” Equal Justice Initiative, 29 Apr. 2020, eji.org/news/americas-massive-misdemeanor-system-deepens-inequality/#:~:text=Natapoff%20estimates%20that%20misdemeanors%20comprise,judges%20face%20crushing%20case%20loads. \nDyne, Emily Van, and Matthew Tinker. “Lange v. California.” Legal Information Institute, Legal Information Institute, 18 Feb. 2021, www.law.cornell.edu/supct/cert/20-18. \nWalsh, Mark. “Supreme Court Considers Warrantless Search-and-Seizure Case from California.” ABA Journal, www.abajournal.com/web/article/scotus-considers-warrantless-search-and-seizure-case-from-california. \n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-02T18:14:29-04:00",
    "input_file": "lange.utf8.md"
  },
  {
    "path": "posts/2021-04-30-my-first-new-post/",
    "title": "Campaign Travel Analysis",
    "description": "In this post I hope to demosntrate a few trends in travel for candidates in the 2020 Presidential Election.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-04-30",
    "categories": [],
    "contents": "\nCandidates attend a lot of events; here are a few trends…\nThe chart below depicts the number of trips to events that Kamala Harris took during her campaign. The number of trips per month plateaus around 8/month with a sudden drop off after August. The drop of is largely due to her dropping out of the presidential race and transitioning to Joe Biden’s VP.\n\n\n{\"x\":{\"visdat\":{\"847038b2d77d\":[\"function () \",\"plotlyVisDat\"]},\"cur_data\":\"847038b2d77d\",\"attrs\":{\"847038b2d77d\":{\"x\":{},\"y\":{},\"alpha_stroke\":1,\"sizes\":[10,100],\"spans\":[1,20],\"type\":\"bar\"}},\"layout\":{\"margin\":{\"b\":40,\"l\":60,\"t\":25,\"r\":10},\"title\":\"Total Trips by Harris each Month\",\"xaxis\":{\"domain\":[0,1],\"automargin\":true,\"title\":\"month\"},\"yaxis\":{\"domain\":[0,1],\"automargin\":true,\"title\":\"n\"},\"hovermode\":\"closest\",\"showlegend\":false},\"source\":\"A\",\"config\":{\"showSendToCloud\":false},\"data\":[{\"x\":[1,2,3,4,5,6,7,8,11,12],\"y\":[8,3,6,12,8,8,8,5,1,2],\"type\":\"bar\",\"marker\":{\"color\":\"rgba(31,119,180,1)\",\"line\":{\"color\":\"rgba(31,119,180,1)\"}},\"error_y\":{\"color\":\"rgba(31,119,180,1)\"},\"error_x\":{\"color\":\"rgba(31,119,180,1)\"},\"xaxis\":\"x\",\"yaxis\":\"y\",\"frame\":null}],\"highlight\":{\"on\":\"plotly_click\",\"persistent\":false,\"dynamic\":false,\"selectize\":false,\"opacityDim\":0.2,\"selected\":{\"opacity\":1},\"debounce\":0},\"shinyEvents\":[\"plotly_hover\",\"plotly_click\",\"plotly_selected\",\"plotly_relayout\",\"plotly_brushed\",\"plotly_brushing\",\"plotly_clickannotation\",\"plotly_doubleclick\",\"plotly_deselect\",\"plotly_afterplot\",\"plotly_sunburstclick\"],\"base_url\":\"https://plot.ly\"},\"evals\":[],\"jsHooks\":[]}\n\n\n\nThe following chart shows the total trips by all candidates to New Hampshire. A possible explanation is that once the NH primary ended, trips began to subside\n\n\n{\"x\":{\"visdat\":{\"84704d9322d3\":[\"function () \",\"plotlyVisDat\"]},\"cur_data\":\"84704d9322d3\",\"attrs\":{\"84704d9322d3\":{\"x\":{},\"y\":{},\"alpha_stroke\":1,\"sizes\":[10,100],\"spans\":[1,20],\"type\":\"bar\"}},\"layout\":{\"margin\":{\"b\":40,\"l\":60,\"t\":25,\"r\":10},\"title\":\"Total Trips to New Hampshire\",\"xaxis\":{\"domain\":[0,1],\"automargin\":true,\"title\":\"month\"},\"yaxis\":{\"domain\":[0,1],\"automargin\":true,\"title\":\"n\"},\"hovermode\":\"closest\",\"showlegend\":false},\"source\":\"A\",\"config\":{\"showSendToCloud\":false},\"data\":[{\"x\":[1,2,3,4,5,6,7,8,12],\"y\":[8,17,19,24,21,14,15,11,3],\"type\":\"bar\",\"marker\":{\"color\":\"rgba(31,119,180,1)\",\"line\":{\"color\":\"rgba(31,119,180,1)\"}},\"error_y\":{\"color\":\"rgba(31,119,180,1)\"},\"error_x\":{\"color\":\"rgba(31,119,180,1)\"},\"xaxis\":\"x\",\"yaxis\":\"y\",\"frame\":null}],\"highlight\":{\"on\":\"plotly_click\",\"persistent\":false,\"dynamic\":false,\"selectize\":false,\"opacityDim\":0.2,\"selected\":{\"opacity\":1},\"debounce\":0},\"shinyEvents\":[\"plotly_hover\",\"plotly_click\",\"plotly_selected\",\"plotly_relayout\",\"plotly_brushed\",\"plotly_brushing\",\"plotly_clickannotation\",\"plotly_doubleclick\",\"plotly_deselect\",\"plotly_afterplot\",\"plotly_sunburstclick\"],\"base_url\":\"https://plot.ly\"},\"evals\":[],\"jsHooks\":[]}\n\n\n\n",
    "preview": {},
    "last_modified": "2021-04-30T17:49:44-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-30-my-second-new-post/",
    "title": "Impeachment Analysis",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-04-30",
    "categories": [],
    "contents": "\n\n# A tibble: 15 x 4\n   first_name last_name    for_impeachment p16winningparty\n   <chr>      <chr>        <chr>           <chr>          \n 1 Anthony    Brindisi     NO              R              \n 2 Cheri      Bustos       NO              R              \n 3 Joe        Cunningham   NO              R              \n 4 Jared      Golden       NO              R              \n 5 Kendra     Horn         NO              R              \n 6 Ron        Kind         NO              R              \n 7 Conor      Lamb         NO              R              \n 8 Susie      Lee          NO              R              \n 9 Ben        McAdams      NO              R              \n10 Lucy       McBath       NO              R              \n11 Tom        O'Halleran   NO              R              \n12 Collin     Peterson     NO              R              \n13 Max        Rose         NO              R              \n14 Xochitl    Torres Small NO              R              \n15 Jefferson  Van Drew     NO              R              \n\n{\"x\":{\"visdat\":{\"891058ef0870\":[\"function () \",\"plotlyVisDat\"]},\"cur_data\":\"891058ef0870\",\"attrs\":{\"891058ef0870\":{\"values\":{},\"alpha_stroke\":1,\"sizes\":[10,100],\"spans\":[1,20],\"type\":\"pie\"}},\"layout\":{\"margin\":{\"b\":40,\"l\":60,\"t\":25,\"r\":10},\"hovermode\":\"closest\",\"showlegend\":true},\"source\":\"A\",\"config\":{\"showSendToCloud\":false},\"data\":[{\"values\":[\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\",\"R\"],\"type\":\"pie\",\"marker\":{\"color\":\"rgba(31,119,180,1)\",\"line\":{\"color\":\"rgba(255,255,255,1)\"}},\"frame\":null}],\"highlight\":{\"on\":\"plotly_click\",\"persistent\":false,\"dynamic\":false,\"selectize\":false,\"opacityDim\":0.2,\"selected\":{\"opacity\":1},\"debounce\":0},\"shinyEvents\":[\"plotly_hover\",\"plotly_click\",\"plotly_selected\",\"plotly_relayout\",\"plotly_brushed\",\"plotly_brushing\",\"plotly_clickannotation\",\"plotly_doubleclick\",\"plotly_deselect\",\"plotly_afterplot\",\"plotly_sunburstclick\"],\"base_url\":\"https://plot.ly\"},\"evals\":[],\"jsHooks\":[]}\n\n\n\n",
    "preview": {},
    "last_modified": "2021-04-30T18:06:01-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-30-proseminar-abstract/",
    "title": "Proseminar Abstract",
    "description": "Below is the abstract for my Proseminar Research Class.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-04-30",
    "categories": [],
    "contents": "\nAbstract\nIn 2004, Colorado passed legislation that enacted its first ever initiative to transition 20 percent of the state’s energy consumption to renewable forms of energy, which include solar, wind, geothermal, and hydroelectric. Nine years later in 2013, the state increased its goal to 30 percent renewable energy. To accomplish this transition, Colorado made the cost of producing carbon dioxide more expensive in the form of a tax per short ton of carbon dioxide emitted. In turn, energy prices in Colorado increased as the tax remittance shifted from firms to consumers of the electricity. Since a higher percentage of Coloradan’s income was now going to pay for energy costs, individuals making less money could be disproportionately affected by this policy change. This paper investigates the distributional effects of the carbon tax policy in Colorado.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-04-30T14:56:56-04:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Dylan's Website",
    "description": "Welcome to my blog site. This blog is a place to post research, news stories, and code. Enjoy reading.",
    "author": [
      {
        "name": "Dylan Lucko",
        "url": "https://dylanlucko.com"
      }
    ],
    "date": "2021-04-30",
    "categories": [],
    "contents": "\n\n\n\n\n",
    "preview": "posts/welcome/images/IMG_7800-05.PNG",
    "last_modified": "2021-05-01T14:58:59-04:00",
    "input_file": {},
    "preview_width": 750,
    "preview_height": 990
  }
]
